"""Для списку цілих чисел потрібно знайти суму елементів
із парними індексами [0-й, 2-й, 4-й ітд],
потім перемножити цю суму на останній елемент вхідного масиву.
Не забудьте, що перший елемент масиву має індекс 0.
Для порожнього масиву результат завжди 0.
"""

"""
[0, 1, 7, 2, 4, 8] => (0 + 7 + 4) * 8 = 88


[1, 3, 5] => 30
[6] => 36
[] => 0
"""

numbers = [0, 1, 7, 2, 4, 8]
num = []

if len(numbers) > 0:

    for i in numbers[::2]:
        num.append(i)
    print(num)

    sum = 0
    for i in num:
        sum += i

    result = sum * numbers[-1]
else:
    result = 0

print(result)